%% Поворот эллипса
% Уравнение, собсвенные числа и собственные значения, поворот эллипса

%% Эллипс
[X, Y, Z] = meshgrid(-100:1:100, -100:1:100, -1:0.01:1);
a11 = 1/15^2; a22 = 1/10^2; a12 = 0.005; a14 = 0; a24 = 0; a44 = -1;
isosurface(X, Y, Z, a11*X.^2 + a22*Y.^2 + 2*a12*X.*Y + 2*a14*X + 2*a24*Y + a44, 0)
axis equal; grid on;
xlabel("x");ylabel("y");zlabel("z");

%% Матрица, собственные вектора и значения, коэффициенты усиления
A = [a11 a12; a12 a22];
[rotM, ev]=eig(A);
gain=sqrt(1./diag(ev));

hold on;

%% Визуализация собственных векторов
p0 = [0 0];
p1 = [rotM(1,1) rotM(2,1)];
p2 = [rotM(1,2) rotM(2,2)];
plot3([p0(1) p1(1)],[p0(2) p1(2)],[0 0]); hold on;
plot3([p0(1) p2(1)],[p0(2) p2(2)],[0 0]); hold on;

%% Определение минимального поворота (диагональ матрицы поворота максимальная и положительная)
[m,im] = max(abs(rotM(1,:)));
rotM2 = rotM;
if im == 2
    rotM2(:,1) = rotM(:,2);
    rotM2(:,2) = rotM(:,1);
end
if rotM2(1,1) < 0
    rotM2(:,1) = -rotM2(:,1);
end
if rotM2(2,2) < 0
    rotM2(:,2) = -rotM2(:,2);
end

%% Поворот эллипса
p12 = p1*rotM2;
p22 = p2*rotM2;
plot3([p0(1) p12(1)],[p0(2) p12(2)],[0 0]); hold on;
plot3([p0(1) p22(1)],[p0(2) p22(2)],[0 0]); hold on;
